{"id": "12", "title": "Murder Ballads", "cover": "data/albums/img/Murder-Ballads.jpg", "year": "1996", "songs": [{"id": "1", "title": "Song Of Joy", "lyrics": ["Have mercy on me, sir [...] Allow me to impose on you [...] I have no place to stay [...] And my bones are cold right through [...] I will tell you a story [...] Of a man and his family [...] And I swear that it is true", "Ten years ago I met a girl named Joy [...] She was a sweet and happy thing [...] Her eyes were bright blue jewels [...] And we were married in the spring [...] I had no idea what happiness a little love could bring [...] Or what life had in store [...] But all things move toward their end [...] All things move toward their end [...] On that you can be sure", "La la la la la la la la la la [...] La la la la la la la la la la", "Then one morning I awoke to find her weeping [...] And for many days to follow [...] She grew so sad and lonely [...] Became Joy in name only [...] Within her breast there launched an unnamed sorrow [...] And a dark and grim force set sail [...] Farewell happy fields [...] Where joy forever dwells [...] Hail horrors hail", "Was it an act of contrition or some awful premonition [...] As if she saw into the heart of her final blood-soaked night [...] Those lunatic eyes, that hungry kitchen knife [...] Ah, I see, sir, that I have your attention! [...] Well, could it be? [...] How often I've asked that question [...] Well, then in quick succession [...] We had babies, one, two, three", "We called them Hilda, Hattie and Holly [...] They were their mother's children [...] Their eyes were bright blue jewels [...] And they were quiet as a mouse [...] There was no laughter in the house [...] No, not from Hilda, Hattie or Holly [...] \"No wonder\", people said, \"poor mother Joy's so melancholy\" [...] Well, one night there came a visitor to our little home", "I was visiting a sick friend [...] I was a doctor then [...] Joy and the girls were on their own", "La la la la la la la la la la [...] La la la la la la la la la la", "Joy had been bound with electrical tape [...] In her mouth a gag [...] She'd been stabbed repeatedly [...] And stuffed into a sleeping bag [...] In their very cots my girls were robbed of their lives [...] Method of murder much the same as my wife's [...] Method of murder much the same as my wife's [...] It was midnight when I arrived home [...] Said to the police on the telephone [...] Someone's taken four innocent lives", "They never caught the man [...] He's still on the loose [...] It seems he has done many many more [...] Quotes John Milton on the walls in the victim's blood [...] The police are investigating at tremendous cost [...] In my house he wrote, \"red right hand\" [...] That, I'm told is from Paradise Lost [...] The wind round here gets wicked cold [...] But my story is nearly told [...] I fear the morning will bring quite a frost", "And so I've left my home [...] I drift from land to land [...] I am upon your step and you are a family man [...] Outside the vultures wheel [...] The wolves howl, the serpents hiss [...] And to extend this small favour, friend [...] Would be the sum of earthly bliss [...] Do you reckon me a friend? [...] The sun to me is dark [...] And silent as the moon [...] Do you, sir, have a room? [...] Are you beckoning me in? [...] La la la la la la la la la la [...] La la la la la la la la la la [...] La la la la la la la la la la [...] La la la la la la la la la la"]}, {"id": "2", "title": "Stagger Lee", "lyrics": ["It was back in '32 when times were hard [...] He had a Colt .45 and a deck of cards [...] Stagger Lee", "He wore rat-drawn shoes and an old stetson hat [...] Had a '28 Ford, had payments on that [...] Stagger Lee", "His woman threw him out in the ice and snow [...] And told him, \"Never ever come back no more\" [...] Stagger Lee", "So he walked through the rain and he walked through the mud [...] Till he came to a place called The Bucket Of Blood [...] Stagger Lee", "He said, \"Mr Motherfucker, you know who I am\" [...] The barkeeper said, \"No, and I don't give a good goddamn\" [...] To Stagger Lee", "He said, \"Well bartender, it's plain to see [...] I'm that bad motherfucker called Stagger Lee\" [...] Mr. Stagger Lee", "Barkeep said, \"Yeah, I've heard your name down the way [...] And I kick motherfucking asses like you every day\" [...] Mr Stagger Lee", "Well, those were the last words that the barkeep said [...] 'Cause Stag put four holes in his motherfucking head", "Just then in came a broad called Nellie Brown [...] Was known to make more money than any bitch in town", "She struts across the bar, hitching up her skirt [...] Over to Stagger Lee, she starts to flirt [...] With Stagger Lee", "She saw the barkeep, said, \"O God, he can't be dead!\" [...] Stag said, \"Well, just count the holes in the motherfucker's head\"", "She said, \"You look like you ain't scored in quite a time. [...] Why not come to my pad? It won't cost you a dime\" [...] Mr. Stagger Lee", "\"But there's something I have to say before you begin [...] You'll have to be gone before my man Billy Dilly comes in, [...] Stagger Lee\"", "\"I'll stay here till Billy Dilly comes in, till time comes to pass [...] And furthermore I'll fuck Billy Dilly in his motherfucking ass\" [...] Said Stagger Lee", "\"I'm a bad motherfucker, don't you know [...] And I'll crawl over fifty good pussies just to get to one fat boy's asshole\" [...] Said Stagger Lee", "Just then Billy Dilly rolls in and said, \"You must be [...] That bad motherfucker called Stagger Lee\" [...] Stagger Lee", "\"Yeah, I'm Stagger Lee and you better get down on your knees [...] And suck my dick, because if you don't you're sure to be dead\" [...] Said Stagger Lee", "Billy Dilly dropped down and slobbered on his head [...] And Stag filled him full of lead [...] Oh yeah."]}, {"id": "3", "title": "Henry Lee", "lyrics": ["Get down, get down, little Henry Lee [...] And stay all night with me [...] You won't find a girl in this damn world [...] That will compare with me [...] And the wind did howl and the wind did blow [...] La la la la la [...] La la la la lee [...] A little bird lit down on Henry Lee", "I can't get down and I won't get down [...] And stay all night with thee [...] For the girl I have in that merry green land [...] I love far better than thee [...] And the wind did howl and the wind did blow [...] La la la la la [...] La la la la lee [...] A little bird lit down on Henry Lee", "She leaned herself against a fence [...] Just for a kiss or two [...] And with a little pen-knife held in her hand [...] She plugged him through and through [...] And the wind did roar and the wind did moan [...] La la la la la [...] La la la la lee [...] A little bird lit down on Henry Lee", "Come take him by his lilly-white hands [...] Come take him by his feet [...] And throw him in this deep deep well [...] Which is more than one hundred feet [...] And the wind did howl and the wind did blow [...] La la la la la [...] La la la la lee [...] A little bird lit down on Henry Lee", "Lie there, lie there, little Henry Lee [...] Till the flesh drops from your bones [...] For the girl you have in that merry green land [...] Can wait forever for you to come home [...] And the wind did howl and the wind did moan [...] La la la la la [...] La la la la lee [...] A little bird lit down on Henry Lee"]}, {"id": "4", "title": "Lovely Creature", "lyrics": ["There she stands, this lovely creature [...] There she stands, there she stands [...] With her hair full of ribbons [...] And green gloves on her hands", "So I asked this lovely creature [...] Yes, I asked. Yes, I asked [...] Would she walk with me a while [...] Through this night so fast", "She took my hand, this lovely creature [...] \"Yes\", she said, \"Yes\", she said [...] \"Yes, I'll walk with you a while\" [...] It was a joyful man she led", "Over hills, this lovely creature [...] Over mountains, over ranges [...] By great pyramids and sphinxs [...] We met drifters and strangers", "Oh the sands, my lovely creature [...] And the mad, moaning winds [...] At night the deserts writhed [...] With diabolical things", "Through the night, through the night [...] The wind lashed and it whipped me [...] When I got home, my lovely creature [...] She was no longer with me", "Somewhere she lies, this lovely creature [...] Beneath the slow drifting sands [...] With her hair full of ribbons [...] And green gloves on her hands"]}, {"id": "5", "title": "Where the Wild Roses Grow", "lyrics": ["They call me The Wild Rose [...] but my name was Elisa Day [...] Why they call me it I do not know [...] For my name was Elisa Day", "From the first day I saw her I knew she was the one [...] As she stared in my eyes and smiled [...] For her lips were the colour of the roses [...] That grew down the river, all bloody and wild", "When he knocked on my door and entered the room [...] My trembling subsided in his sure embrace [...] He would be my first man, and with a careful hand [...] He wiped at the tears that ran down my face", "They call me The Wild Rose [...] but my name was Elisa Day [...] Why they call me it I do not know [...] For my name was Elisa Day", "On the second day I brought her a flower [...] She was more beautiful than any woman I'd seen [...] I said, \"Do you know where the wild roses grow [...] So sweet and scarlet and free?\"", "On the second day he came with a single red rose [...] Said: \"Will you give me your loss and your sorrow?\" [...] I nodded my head, as I lay on the bed [...] He said, \"If I show you the roses will you follow?\"", "They call me The Wild Rose [...] but my name was Elisa Day [...] Why they call me it I do not know [...] For my name was Elisa Day", "On the third day he took me to the river [...] He showed me the roses and we kissed [...] And the last thing I heard was a muttered word [...] As he stood smiling above me with a rock in his fist", "On the last day I took her where the wild roses grow [...] And she lay on the bank, the wind light as a thief [...] As I kissed her goodbye, I said, \"All beauty must die\" [...] And lent down and planted a rose between her teeth", "They call me The Wild Rose [...] but my name was Elisa Day [...] Why they call me it I do not know [...] For my name was Elisa Day"]}, {"id": "6", "title": "The Curse of Millhaven", "lyrics": ["I live in a town called Millhaven [...] And it's small and it's mean and it's cold [...] But if you come around just as the sun goes down [...] You can watch the whole town turn to gold [...] It's around about then that I used to go a-roaming [...] Singing La la la la La la la lie [...] All God's children they all gotta die", "My name is Loretta but I prefer Lottie [...] I'm closing in on my fifteenth year [...] And if you think you have seen a pair of eyes more green [...] Then you sure didn't see them round here [...] My hair is yellow and I'm always a-combing [...] La la la la La la la lie [...] Mama often told me we all have to die", "You must have heard about The Curse Of Millhaven [...] How last Christmas Bill Blake's little boy didn't come home [...] They found him next week in One Mile Creek [...] His head bashed in and his pockets full of stones [...] Well, just imagine the wailing and moaning [...] La la la la La la la lie [...] Even little Billy Blake, he had to die", "Then Professor O'Rye from Millhaven High [...] Found nailed to his door, his prize-winning terrier [...] The next day the old fool brought little Biko to school [...] And we all had to watch as he buried her [...] His eulogy to Biko had all the tears a-flowing [...] La la la la La la la lie [...] Even God's little creatures, they have to die", "Our little town fell into a state of shock [...] A lot of people were saying things that made little sense [...] Then the next thing you know the head of Handyman Joe [...] Was found in the fountain of the Mayor's residence [...] Foul play can really get a small town going [...] La la la la La la la lie [...] All God's children all have to die", "Then, in a cruel twist of fate, old Mrs Colgate [...] Was stabbed but the job was not complete [...] The last thing she said before the cops pronounced her dead [...] Was, \"My killer is Loretta and she lives across the street!\" [...] Twenty cops burst through my door without even phoning [...] La la la la La la la lie [...] The young ones, the old ones, they all gotta die", "Yes, it is I, Lottie. The curse of Millhaven [...] I've struck horror in the heart of this town [...] Like my eyes ain't green and my hair ain't yellow [...] It's more like the other way around [...] I gotta pretty little mouth underneath all the foaming [...] La la la la La la la lie [...] Sooner or later we all gotta die", "Since I was no bigger than a weavil they've been saying I was evil [...] That if \"bad\" was a boot then I'd fit it [...] That I'm a wicked young lady, but I've been trying hard lately [...] O fuck it! I'm a monster! I admit it! [...] It makes me so mad my blood really starts a-going [...] La la la la La la la lie [...] Mama always told me that we all gotta die", "Yeah, I drowned the Blakey kid, stabbed Mrs. Colgate, I admit [...] Did the handyman with his circular saw in his garden shed [...] But I never crucified little Biko, that was two junior high school psychos [...] Stinky Bohoon and his friend with the pumpkin-sized head [...] I'll sing to the lot, now you got me going [...] La la la la La la la lie [...] All God's children have all gotta die", "There were all of the others, all our sisters and brothers [...] You assumed were accidents, best forgotten [...] Recall the children who broke through the ice on Lake Tahoo? [...] Everyone assumed the \"Warning\" signs had followed them to the bottom [...] Well, they're underneath the house where I do quite a bit of stowing [...] La la la la La la la lie [...] Even twenty little children, they had to die", "And the fire of '91 that razed the Bella Vista slum [...] There was the biggest shit-fight this country's ever seen [...] Insurance companies ruined, land lords getting sued [...] All cause of a wee little girl with a can of gasoline [...] Those flames really roared when the wind started blowing [...] La la la la La la la lie [...] Rich man, poor man, all got to die", "Well I confessed to all these crimes and then they put me on trial [...] I was laughing when they took me away [...] Off to the asylum in an old black Mariah [...] It ain't home, but you know, it's fucking better than jail [...] It ain't such a bad old place to have a home in [...] La la la la La la la lie [...] All God's children they all gotta die", "Now I got shrinks that will not rest with their endless Rorschach tests [...] I keep telling them they're out to get me [...] They ask me if I feel remorse and I answer, \"Why of course! [...] There is so much more I could have done if they'd let me!\" [...] So it's Rorschach and Prozac and everything is groovy [...] Singing La la la la La la la lie [...] All God's children have all gotta die [...] La la la la La la la lie [...] I'm happy as a lark and everything is fine [...] Singing La la la la La la la lie [...] Yeah, everything is groovy and everything is fine [...] Singing La la la la La la la lie [...] All God's children they all gotta die"]}, {"id": "7", "title": "The Kindness of Strangers", "lyrics": ["They found Mary Bellows cuffed to the bed [...] With a rag in her mouth and a bullet in her head [...] O poor Mary Bellows", "She'd grown up hungry, she'd grown up poor [...] So she left her home in Arkansas [...] O poor Mary Bellows", "She wanted to see the deep blue sea [...] She drove across Tennessee [...] O poor Mary Bellows", "She met a man along the way [...] He introduced himself as Richard Slade [...] O poor Mary Bellows", "Poor Mary thought that she might die [...] When she saw the ocean for the first time [...] O poor Mary Bellows", "She checked into a cheap little place [...] Richard Slade carried in her old suitcase [...] O poor Mary Bellows", "\"I'm a good girl, sir,\" she said to him [...] I couldn't possibly permit you in [...] O poor Mary Bellows", "Slade tipped his hat and winked his eye [...] And turned away without goodbye [...] O poor Mary Bellows", "She sat on her bed and thought of home [...] With the sea breeze whistling all alone [...] O poor Mary Bellows", "In hope and loneliness she crossed the floor [...] And undid the latch on the front door [...] O poor Mary Bellows", "They found her next day cuffed to the bed [...] A rag in her mouth and a bullet in her head [...] O poor Mary Bellows", "So mothers keep your girls at home [...] Don't let them journey out alone [...] Tell them this world is full of danger [...] And to shun the company of strangers [...] O poor Mary Bellows [...] O poor Mary Bellows"]}, {"id": "8", "title": "Crow Jane", "lyrics": ["Crow Jane Crow Jane [...] Crow Jane [...] Horrors in her head [...] That her tongue dare not name [...] Lived all alone by the river [...] The rolling rivers of pain [...] Crow Jane Crow Jane [...] Crow Jane Ah hah huh", "There is one shining eye on a hard-hat [...] Company closed down the mine [...] Winking on the waters they came [...] Twenty hard-hats, twenty eyes [...] In her clapboard shack [...] Just six foot by five [...] They killed all her whiskey [...] Poured their pistols dry [...] Crow Jane Crow Jane [...] Crow Jane Ah hah huh", "Seems you've remembered [...] How to sleep, how to sleep [...] The house dogs are in your turnips [...] And your yard dogs are running all over the streets [...] Crow Jane Crow Jane [...] Crow Jane Ah hah huh", "\"O Mr. Smith and Mr. Wesson [...] Why you close up shop so late?\" [...] \"Just fitted out a girl who looked like a bird [...] Measured .32, .44, .38 [...] Asked that girl which road she was taking [...] Said she was walking the road of hate [...] But she hopped on a coal-trolley up to New Haven [...] Population: 48\" [...] Crow Jane Crow Jane [...] Crow Jane Ah hah huh", "Your guns are drunk and smoking [...] They have followed you to the gate [...] Laughing all the way back from the new town [...] Population, now, 28 [...] Crow Jane Crow Jane [...] Crow Jane Ah hah huh"]}, {"id": "9", "title": "O'Malley's Bar", "lyrics": ["I am tall and I am thin [...] Of an enviable height [...] And I've been known to be quite handsome [...] From a certain angle and in a certain light [...] Well I entered into O'Malley's [...] Said, \"O'Malley I have a thirst\" [...] O'Malley merely smiled at me [...] Said \"You wouldn't be the first\" [...] I knocked on the bar and pointed [...] To a bottle on the shelf [...] And as O'Malley poured me out a drink [...] I sniffed and crossed myself [...] My hand decided that the time was nigh [...] And for a moment it slipped from view [...] And when it returned, it fairly burned [...] With confidence anew [...] Well the thunder from my steely fist [...] Made all the glasses jangle [...] When I shot him, I was so handsome [...] It was the light, it was the angle", "Huh! Hmmmmm", "\"Neighbours!\" I cried, \"Friends!\" I screamed [...] I banged my fist upon the bar [...] \"I bear no grudge against you!\" [...] And my dick felt long and hard [...] \"I am the man for which no God waits [...] For which the whole world yearns [...] I'm marked by darkness and by blood [...] And one thousand powder-burns\" [...] Well, you know those fish with the swollen lips [...] That clean the ocean floor? [...] When I looked at poor O'Malley's wife [...] That is exactly what I saw [...] I jammed the barrel under her chin [...] And her face looked raw and vicious [...] Her head it landed in the sink [...] With all the dirty dishes [...] Her little daughter Siobhan [...] Pulled beers from dusk till dawn [...] And amongst the townfolk, she was a bit of a joke [...] But she pulled the best beers in town [...] I swooped magnificent upon her [...] As she sat shivering in her grief [...] Like the Madonna painted on the church-house wall [...] In whale's blood and banana leaf [...] Her throat it crumbled in my fist [...] And I spun heroically around [...] To see Caffrey rising from his chair [...] I shot that mother fucker down", "Mmmmmmmmm Yeah Yeah Yeah", "\"I have no free will,\" I sang [...] As I flew about the murder [...] Mrs. Richard Holmes, she screamed [...] You really should have heard her [...] I sang and I laughed, I howled and I wept [...] I panted like a pup [...] I blew a hole in Mrs. Richard Holmes [...] And her husband he stood up [...] And he screamed, \"You are an evil man\" [...] And I paused a while to wonder [...] \"If I have no free will then how can I [...] Be morally culpable, I wonder\" [...] I shot Richard Holmes in the stomach [...] And gingerly he sat down [...] And he whispered weirdly, \"No offense\" [...] And lay upon the ground [...] \"None taken,\" I replied to him [...] With which he gave a little cough [...] With blazing wings I neatly aimed [...] And blew his head completely off [...] I've lived in this town for thirty years [...] And to no-one am I a stranger [...] And I put new bullets in my gun [...] Chamber upon chamber [...] And when I turned my gun on the bird-like Mr. Brookes [...] I thought of Saint Francis and his sparrows [...] And as I shot down the youthful Richardson [...] It was St. Sebastian I thought of, and his arrows", "Hhhhhhhhhhhh Mmmmmmmmm", "I said, \"I want to introduce myself [...] And I am glad that you all came\" [...] And I leapt upon the bar [...] And shouted out my name [...] Well Jerry Bellows, he hugged his stool [...] Closed his eyes and shrugged and laughed [...] And with an ashtray as big as a fucking big brick [...] I split his head in half [...] His blood spilled across the bar [...] Like a steaming scarlet brook [...] And I knelt at it's edge on the counter [...] Wiped the tears away and looked [...] Well, the light in there was blinding [...] Full of God and ghosts and truth [...] I smiled at Henry Davenport [...] Who made an attempt to move [...] Well, from the position I was standing [...] The strangest thing I ever saw [...] The bullet entered through the top of his chest [...] And blew his bowels out on the floor [...] Well I floated down the counter [...] Showing no remorse [...] I shot a hole in Kathleen Carpenter [...] Recently divorced [...] But remorse I felt and remorse I had [...] It clung to every thing [...] From the raven's hair upon my head [...] To the feathers on my wings [...] Remorse squeezed my hand in it's fraudulent claw [...] With it's golden hairless chest [...] And I glided through the bodies [...] And killed the fat man Vincent West [...] Who sat quietly in his chair [...] A man become a child [...] And I raised the gun up to his head [...] Executioner-style [...] He made no attempt to resist [...] So fat and dull and lazy [...] \"Do you know I lived in your street?\" I cried [...] And he looked at me as though I were crazy [...] \"O\", he said, \"I had no idea\" [...] And he grew as quiet as a mouse [...] And the roar of the pistol when it went off [...] Near blew the hat right off the house", "Well, I caught my eye in the mirror [...] And gave it a long and loving inspection [...] \"There stands some kind of man\", I roared [...] And there did, in the reflection [...] My hair combed back like a raven's wing [...] My muscles hard and tight [...] And curling from the business end of my gun [...] Was a query-mark of cordite [...] Well I spun to the left, I spun to the right [...] And I spun to the left again [...] \"Fear me! Fear me!\" [...] But no one did cause they were dead", "Huh! Hmmmmmmmm", "And then there were the police sirens wailing [...] And a bull-horn squelched and blared [...] \"Drop your weapons and come out [...] With your hands held in the air\" [...] Well, I checked the chambers of my gun [...] Saw I had one final bullet left [...] My hand, it looked almost human [...] As I held it to my head [...] \"Drop your weapon and come out! [...] Keep your hands above your head!\" [...] Well, I had one long hard think about dying [...] And did exactly what they said [...] There must have been fifty cops out there [...] In a circle around O'Malley's bar [...] \"Don't shoot\", I cried, \"I'm a man unarmed!\" [...] So they put me in their car [...] And they sped me away from that terrible scene [...] And I glanced out of the window [...] Saw O'Malley's bar, saw the cops and the cars [...] And started counting on my fingers", "Aaaaaaaaah One Aaaaaaaah Two Aaaaaah Three Aaaah Four [...] O'Malley's bar O'Malley's bar"]}, {"id": "10", "title": "Death is Not the End", "lyrics": ["When you're sad and when you're lonely [...] And you haven't got a friend [...] Just remember that death is not the end", "And all that you held sacred [...] Falls down and does not mend [...] Just remember that death is not the end [...] Not the end, not the end [...] Just remember that death is not the end", "When you're standing on the crossroads [...] That you cannot comprehend [...] Just remember that death is not the end", "And all your dreams have vanished [...] And you don't know what's up the bend [...] Just remember that death is not the end [...] Not the end, not the end [...] Just remember that death is not the end", "When the storm clouds gather round you [...] And heavy rains descend [...] Just remember that death is not the end", "And there is no-one there to comfort you [...] With a helping hand to lend [...] Just remember that death is not the end [...] Not the end, not the end [...] Just remember that death is not the end", "For the tree of life is growing [...] Where the spirit never dies [...] And the bright light of salvation [...] Up in dark and empty skies [...] When the cities are on fire [...] With the burning flesh of men [...] Just remember that death is not the end", "And you search in vain to find [...] Some law-abiding citizen [...] Just remember that death is not the end [...] Not the end, not the end [...] Just remember that death is not the end [...] Not the end, not the end [...] Just remember that death is not the end"]}]}